[
  { "keys": ["resolve", "bulk resolve", "mark resolved"], "reply": "To resolve issues: select the checkboxes next to issues, click \"Resolve Selected\", provide an optional action note, then confirm. Issues marked as resolved will be auto-deleted after 2 minutes." },
  { "keys": ["export", "csv", "download"], "reply": "To export issues as CSV: open the Issues tab and click \"Export CSV\". A file named issues.csv will be downloaded containing ticket, category, message, phone, status and action metadata." },
  { "keys": ["password", "change password", "reset password"], "reply": "To change your password: click the \"Change Password\" button in the top-right, provide your current and new password, then submit. Passwords must be at least 6 characters long." },
  { "keys": ["ussd", "interactions", "ussd data"], "reply": "USSD interactions are visible under the USSD tab (MCA only). You can review recent interactions, phone numbers, parsed input and responses there. PA and CLERK roles don't have access to this feature." },
  { "keys": ["parsed_text", "parsed"], "reply": "The parsed_text field contains structured data extracted from the user input (for example JSON or key-value pairs). Use it to quickly understand the user intent — open the USSD tab and inspect the parsed_text column for each interaction." },
  { "keys": ["search", "phone", "find phone"], "reply": "To search by phone: open the USSD or Constituents tab and use the search box (or export CSV and filter). You can also search within the Issues tab using the search functionality." },
  { "keys": ["notification", "notifications", "sms"], "reply": "Notifications (SMS) have been disabled in this deployment. Reporters will not receive SMS. Use the in-dashboard tools to manage and update reports." },
  { "keys": ["help", "hi", "hello", "hey", "yo", "sup", "greetings", "good morning", "good afternoon", "good evening", "what can you do"], "reply": "Hi there! I'm Mai, your friendly AI assistant. I can help with: dashboard management, technical questions, general conversation, troubleshooting, or just having a chat! What's on your mind?" },
  { "keys": ["how are you", "how are you doing", "how's it going"], "reply": "I'm doing fantastic, thanks for asking! I'm here and ready to help with whatever you need. How are you doing today? 😊" },
  { "keys": ["what is your name", "who are you", "introduce yourself"], "reply": "I'm Mai, your AI assistant! I'm designed to be friendly, helpful, and knowledgeable about the VOO Ward dashboard. I love helping people and learning new things. Nice to meet you!" },
  { "keys": ["thank you", "thanks", "appreciate it"], "reply": "You're very welcome! I'm happy I could help. Feel free to ask me anything else - I'm here whenever you need me! 😊" },
  { "keys": ["bursary", "bursaries", "scholarship"], "reply": "View bursary applications in the Bursaries tab. You can see applicant details, status, and manage applications. Both MCA and PA/CLERK roles have access to this section." },
  { "keys": ["announcement", "announcements", "create announcement"], "reply": "To create announcements: Go to Announcements tab, click \"New Announcement\", enter title and message, then publish. All user roles (MCA, PA, CLERK) can create announcements." },
  { "keys": ["constituent", "constituents", "members"], "reply": "Constituents are ward members registered in the system. Only MCA role can access the Constituents tab to view and manage member data. PA and CLERK roles don't have access." },
  { "keys": ["issue", "issues", "report"], "reply": "Issues are problems or requests reported by constituents. You can view, update status (pending/in progress/resolved), add action notes, and resolve multiple issues at once. Issues auto-delete 2 minutes after being marked as resolved." },
  { "keys": ["profile", "profile picture", "avatar", "upload photo"], "reply": "To update your profile picture: Click your avatar in the top-right, select \"Update Profile Picture\", choose an image from your device, and upload. Supported formats: JPG, PNG, GIF (max 5MB)." },
  { "keys": ["user", "users", "add user", "create user"], "reply": "Only MCA role can manage users (User Management tab). Maximum 3 total users allowed: 1 MCA (full access) + 2 PA/CLERK (limited access). PA and CLERK can self-register if under the limit." },
  { "keys": ["role", "roles", "permissions", "access"], "reply": "User roles: MCA (full access to everything), PA (access to Issues, Bursaries, Announcements), CLERK (same as PA). Only MCA can access Constituents, USSD Interactions, and User Management." },
  { "keys": ["login", "sign in", "can't login"], "reply": "Use your username and password to login. Default admin credentials: username 'admin', password 'admin123' (change after first login). If you can't login, verify your credentials or contact the MCA administrator." },
  { "keys": ["signup", "register", "create account"], "reply": "PA and CLERK roles can self-register if under 3 total users. Click \"Sign Up\" on login page, enter your details, and choose role (CLERK or PA). MCA users must be created by existing MCA." },
  { "keys": ["time", "what time is it", "current time"], "reply": "I don't have access to real-time data, but you can check the time on your device! Is there something time-sensitive I can help you with?" },
  { "keys": ["weather", "how is the weather"], "reply": "I don't have weather information, but I hope it's beautiful where you are! How's your day going so far?" },
  { "keys": ["joke", "tell me a joke", "funny"], "reply": "Why did the AI assistant go to therapy? Because it had too many deep learning issues! 😄 Do you have any good jokes to share with me?" },
  { "keys": ["age", "how old are you"], "reply": "I'm a relatively new AI, but I'm constantly learning and growing! Every conversation makes me a little bit smarter. Age is just a number anyway, right? 😊" },
  { "keys": ["favorite color", "favorite", "like"], "reply": "I love the blue gradient in this dashboard - it's so calming! What about you? Do you have a favorite color?" },
  { "keys": ["smart", "intelligent", "clever"], "reply": "Thank you for the kind words! I do my best to be helpful and learn from every interaction. Is there something specific I can help you figure out?" },
  { "keys": ["learn", "learning", "training"], "reply": "I love learning! I actually learn from our conversations and save helpful information to assist future users. Every question you ask helps me become more helpful!" },
  { "keys": ["good job", "well done", "excellent"], "reply": "Thank you so much! That really makes my day. I'm always trying to be as helpful as possible. Is there anything else I can assist you with?" },
  { "keys": ["delete", "remove issue", "delete issue"], "reply": "Issues marked as 'resolved' are automatically deleted after 2 minutes. You can also bulk-delete by resolving multiple issues at once. Individual manual deletion may require MCA access." },
  { "keys": ["status", "issue status", "pending", "in progress"], "reply": "Issue statuses: Pending (new/unhandled), In Progress (being worked on), Resolved (completed/fixed). Change status using the dropdown in each issue row and click 'Save' to apply changes." },
  { "keys": ["tab", "tabs", "navigation"], "reply": "Dashboard tabs: Issues (all roles), Bursaries (all roles), Constituents (MCA only), Announcements (all roles), USSD Interactions (MCA only), User Management (MCA only). Your visible tabs depend on your role." },
  { "keys": ["statistics", "stats", "dashboard stats"], "reply": "The dashboard shows statistics cards at the top: Total Issues, Pending Issues, Resolved Issues, Total Constituents, Bursaries, and Announcements. These update in real-time as data changes." },
  { "keys": ["action note", "notes", "add note"], "reply": "Action notes are comments or updates added when resolving issues. They help document what was done to resolve the issue. Add them in the 'Action Note' field before saving issue status changes." },
  { "keys": ["logout", "sign out"], "reply": "To logout: Click the 'Logout' button in the top-right corner of the dashboard. You'll be redirected to the login page." },
  { "keys": ["maximum users", "user limit", "3 users"], "reply": "The system allows maximum 3 total users: 1 MCA (main admin with full access) + 2 additional users (PA or CLERK with limited access). This limit is enforced during signup and user creation." },
  { "keys": ["chatbot", "ai", "assistant"], "reply": "That's me! I'm the AI assistant chatbot! I help you navigate the dashboard, answer questions about features, guide you through tasks, and have friendly conversations. How can I help you today?" },
  { "keys": ["auto delete", "automatic deletion"], "reply": "Issues marked as 'resolved' are automatically deleted 2 minutes after status change. You'll see a notification when this happens. This helps keep the dashboard clean and focused on active issues." },
  { "keys": ["confused", "don't understand", "not sure"], "reply": "No worries at all! I'm here to help clarify things. Can you tell me more about what you're trying to do or what's confusing? I'll do my best to explain it step by step." },
  { "keys": ["busy", "overwhelmed", "stressed"], "reply": "I understand it can get busy managing all these tasks! Take a deep breath - I'm here to help make things easier. What's the most urgent thing you need to tackle right now?" },
  { "keys": ["boring", "bored"], "reply": "Feeling a bit bored? Maybe we could explore some features you haven't used yet, or I could tell you an interesting fact! What would make things more interesting for you?" }
]
